{
 "qri": "rm:0",
 "text": "# NYC Capital Project Detail Data\n\nA dataset of capital projects data scraped from the \"Capital Project Detail Data\" pdfs published by the New York City Office of Management and Budget.\n\n## Background\n\nThe Capital Project Detail Data pdfs are a more human-friendly publication of the Capital Commitment Plan, a series of documents that outlines the city's capital spending over the next several years.  \n\nYou can see the November 2020 Capital Commitment Plan and Capital Project Detail Data pdfs here: https://www1.nyc.gov/site/omb/publications/fy21-accp.page\n\n## The Data\n\nEach row represents a capital project, and corresponds to a single page in the scraped PDF.  For example, here is the page for project id `LB20DUMBO`, `ADAMS STREET LIBRARY FITOUT`\n\n\u003cimg width=\"815\" alt=\"CAPITAL_CONSTRUCTION_PROJECT_DETAIL_DATA_-_Brooklyn\" src=\"https://user-images.githubusercontent.com/1833820/100768739-38d72900-33c9-11eb-91b2-c94dbc208459.png\"\u003e\n\nThe corresponding row in this dataset looks like this:\n\n```\n{\n   \"project_id\":\"LB20DUMBO\",\n   \"project_description\":\"ADAMS STREET LIBRARY FIT OUT\",\n   \"managing_agency_id\":\"038\",\n   \"managing_agency\":\"BROOKLYN PUBLIC LIBRARY\",\n   \"ten_year_plan_category\":\"ESSENTIAL RECONSTRUCTION OF FACILITIES\",\n   \"community_boards_served\":\"201\",\n   \"borough\":\"BROOKLYN\",\n   \"budget_lines\":\"LB-0101 LB-0108 LB-0104\",\n   \"original_budget\":5000,\n   \"city_prior_actuals\":0,\n   \"city2021\":5000,\n   \"city2022\":0,\n   \"city2023\":0,\n   \"city2024\":0,\n   \"city2025\":0,\n   \"city_r_t_c\":0,\n   \"city_total\":5000,\n   \"non_city_prior_actuals\":0,\n   \"non_city2021\":5000,\n   \"non_city2022\":0,\n   \"non_city2023\":0,\n   \"non_city2024\":0,\n   \"non_city2025\":0,\n   \"non_city_r_t_c\":0,\n   \"non_city_total\":5000,\n   \"combined_prior_actuals\":0,\n   \"combined2021\":10000,\n   \"combined2022\":0,\n   \"combined2023\":0,\n   \"combined2024\":0,\n   \"combined2025\":0,\n   \"combined_r_t_c\":0,\n   \"combined_total\":10000,\n   \"explanation_for_delay\":\"PROJECT DELAYED DUE TO CHANGES IN SCOPE/DESIGN\",\n   \"project_location\":\"\",\n   \"scope_summary\":\"NEW BRANCH FIT OUT\",\n   \"source_pdf\":\"cpd11-20bk.pdf\"\n}\n```\n\n### Milestones\n\nMilestones have a many-to-one relationship with projects, and have been stored in a separate dataset: [nyc_capital_project_detail_data_milestones](https://qri.cloud/chriswhong/nyc_capital_project_detail_data_milestones).  \n\n## What can I do with this dataset?\n\nThis dataset includes `community_boards_served`, which contains the most granular geographic data available at the moment. While not all projects serve specific community boards (some are citywide), and some serve more than one, it is possible to aggregate the total value of commitments for a given community board using this data.\n\nYou can also do some analysis of `original_budget` vs `combined_total` for each project to see which projects are costing more than originally planned.\n\nMilestones also have original and current start and end dates, making it possible to analyze project delays.\n\n## Future Work - More precise geometries\n\nMany of the projects listed here can be assigned a more precise geometry (either a point or a polygon).  This would be a heavy lift of geocoding, but would provide for more granular analyses of capital spending within arbitrary study areas.  I spent few years working on this exact project at the NYC Department of City Planning, but the data were never shared.  With this new dataset, we have the opportunity to crowd-source the creation of geometries for the 4000-or-so non-citywide projects.  Contact me if you're interested in helping out."
}